# 5 - Есть список случайных чисел в промежутке от 1 до 100, количеством 200.
# Создайте список кортежей, первый элемент которого - индекс элемента, а второй - сам элемент, при условии, что они не совпадают.
# Пример:
# [1,1,1,1] -> [(0,1),(1,1),(2,1),(3,1)] -> [(0,1),(2,1),(3,1)]

# 6 - Из списка выше оставьте только те пары, где сумма кортежа кратна 5
# Пример:
# [(10,25),(3,4),(4,1)] => [(10,25),(4,1)]

from random import randint
num = [randint(1, 100) for i in range(1, 101)]
ind = [n for n in range(1, 101)]
res = list(zip(ind, num))
print(res[1][0])
res_new_1 = []
res_new_2 = []
for ind, num in res:
    if ind != num:
        if (ind + num) % 5 == 0:
            res_new_1.append((ind, num))

new_res = list(zip(res_new_1))
print(len(res))
print('Список кортежей по задаче № 5: \n', res)
print('Количечтво кортежей после отбора: \n', len(new_res))
print('Список кортежей по задаче № 6: \n', new_res)